# CannotConnectDifferentDesignOptsObjects Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..CannotConnectDifferentDesignOptsObjects Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Cannot add or assign [Element] to circuit. Electrical objects belonging to different design options cannot be connected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotConnectDifferentDesignOptsObjects { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotConnectDifferentDesignOptsObjects As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotConnectDifferentDesignOptsObjects {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace